Revit 2027 API
Rebar.GetSpacingsBetweenBars Method
 Gets the spacings between all bars in set that have CustomSpacing layout. It will consider that there are no moved or removed bars from the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetSpacingsBetweenBars()
Public Function GetSpacingsBetweenBars As IList(Of Double)
public:
IList<double>^ GetSpacingsBetweenBars()
member GetSpacingsBetweenBars : unit -> IList<float>
Return Value
IList<Double>
 Returns the spacings between all bars in set.
Exceptions
Exception | Condition
InvalidOperationException |  Rebar should have CustomSpacing layout. -or- The Free Form Rebar doesn't have set a distribution path.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace